daleondev/STM32_CANopen/src/SerialCLI.cpp
#include "SerialCLI.hpp"

#include <array>
#include <cctype>
#include <cstdio>
#include <cstdlib>
#include <cstring>

extern "C"
{
#include "stm32h7xx_hal.h"
#include "stm32h7xx_nucleo.h"
}

namespace SerialCLI
{

    /* -------------------------------------------------------------------------- */
    /* Module state                                                               */
    /* -------------------------------------------------------------------------- */
    static Interfaces::HLDriver::ICANopen *s_canopen = nullptr;
    static Interfaces::HLDriver::ICiA402 *s_motor = nullptr;
    static Interfaces::HLDriver::INanotecPnD *s_nanotec = nullptr;

    /* -------------------------------------------------------------------------- */
    /* UART helpers                                                               */
    /* -------------------------------------------------------------------------- */
    static constexpr size_t MAX_CMD_LEN = 128;

    /**
     * @brief Read a line from UART (blocking, with echo).
     * @return Number of characters read (excluding null terminator).
     */
    static size_t readLine(char *buf, size_t maxLen)
    {
        size_t pos = 0;
        while (pos < maxLen - 1)
        {
            uint8_t ch = 0;

            /* Blocking receive, one byte at a time */
            if (HAL_UART_Receive(&hcom_uart[COM1], &ch, 1, HAL_MAX_DELAY) != HAL_OK)
            {
                continue;
            }

            /* Echo */
            HAL_UART_Transmit(&hcom_uart[COM1], &ch, 1, HAL_MAX_DELAY);

            if (ch == '\r' || ch == '\n')
            {
                printf("\r\n");
                break;
            }
            else if (ch == '\b' || ch == 127) /* Backspace / DEL */
            {
                if (pos > 0)
                {
                    pos--;
                    printf("\b \b");
                }
            }
            else
            {
                buf[pos++] = static_cast<char>(ch);
            }
        }
        buf[pos] = '\0';
        return pos;
    }

    /**
     * @brief Parse a hex or decimal number from string.
     */
    static uint32_t parseNumber(const char *str)
    {
        if (str == nullptr)
        {
            return 0;
        }
        if (str[0] == '0' && (str[1] == 'x' || str[1] == 'X'))
        {
            return static_cast<uint32_t>(strtoul(str, nullptr, 16));
        }
        return static_cast<uint32_t>(strtoul(str, nullptr, 10));
    }

    /* -------------------------------------------------------------------------- */
    /* Command handlers                                                           */
    /* -------------------------------------------------------------------------- */
    static void cmdHelp()
    {
        printf("Available commands:\r\n");
        printf("  help                              - Show this help\r\n");
        printf("  status                            - Show CANopen status\r\n");
        printf("  nmt <start|stop|preop|reset> <id> - Send NMT command (id=0 for all)\r\n");
        printf("  sdo read <nodeId> <index> <sub>   - SDO upload (read from remote)\r\n");
        printf("  sdo write <nodeId> <idx> <sub> <byte0> [byte1..] - SDO download\r\n");
        if (s_motor != nullptr)
        {
            printf("Motor commands:\r\n");
            printf("  motor init                        - Init drive (configure PDOs, go operational)\r\n");
            printf("  motor enable                      - Enable drive (OperationEnabled)\r\n");
            printf("  motor disable                     - Disable drive\r\n");
            printf("  motor stop                        - Quick stop\r\n");
            printf("  motor status                      - Show drive status\r\n");
            printf("  motor mode <pp|pv>                - Set operation mode\r\n");
            printf("  motor move <pos> [rel]            - Move to position (optional: rel)\r\n");
            printf("  motor velocity <vel>              - Set target velocity\r\n");
            printf("  motor fault-reset                 - Reset fault\r\n");
        }
        if (s_nanotec != nullptr)
        {
            printf("Nanotec Plug & Drive commands:\r\n");
            printf("  nt config <nodeId> <peakI> <nomI> - Configure (current in mA)\r\n");
            printf("  nt autosetup                      - Run auto setup (motor moves!)\r\n");
            printf("  nt enable                         - Enable drive\r\n");
            printf("  nt disable                        - Disable drive\r\n");
            printf("  nt stop                           - Quick stop\r\n");
            printf("  nt reset                          - Fault reset\r\n");
            printf("  nt mode <mode>                    - Set mode (-1=auto,1=pp,3=pv)\r\n");
            printf("  nt profile <vel> <acc> <dec>      - Set profile params\r\n");
            printf("  nt move <pos> [rel]               - Position move\r\n");
            printf("  nt vel <velocity>                 - Set target velocity\r\n");
            printf("  nt halt                           - Halt motion\r\n");
            printf("  nt status                         - Read drive status\r\n");
            printf("  nt save                           - Save params to NVM\r\n");
        }
    }

    static void cmdStatus()
    {
        if (s_canopen == nullptr)
        {
            printf("CANopen: not initialized\r\n");
            return;
        }
        printf("CANopen running: %s\r\n", s_canopen->isRunning() ? "yes" : "no");
    }

    static void cmdNMT(char *args)
    {
        if (s_canopen == nullptr)
        {
            printf("CANopen not initialized\r\n");
            return;
        }

        char *cmd = strtok(args, " ");
        char *idStr = strtok(nullptr, " ");

        if (cmd == nullptr || idStr == nullptr)
        {
            printf("Usage: nmt <start|stop|preop|reset|resetcomm> <nodeId>\r\n");
            return;
        }

        uint8_t nodeId = static_cast<uint8_t>(parseNumber(idStr));
        uint8_t nmtCmd = 0;

