daleondev/STM32_CANopen/src/SerialCLI.cpp
        if (strcmp(cmd, "start") == 0)
        {
            nmtCmd = 1; /* CO_NMT_ENTER_OPERATIONAL */
        }
        else if (strcmp(cmd, "stop") == 0)
        {
            nmtCmd = 2; /* CO_NMT_ENTER_STOPPED */
        }
        else if (strcmp(cmd, "preop") == 0)
        {
            nmtCmd = 128; /* CO_NMT_ENTER_PRE_OPERATIONAL */
        }
        else if (strcmp(cmd, "reset") == 0)
        {
            nmtCmd = 129; /* CO_NMT_RESET_NODE */
        }
        else if (strcmp(cmd, "resetcomm") == 0)
        {
            nmtCmd = 130; /* CO_NMT_RESET_COMMUNICATION */
        }
        else
        {
            printf("Unknown NMT command: %s\r\n", cmd);
            return;
        }

        bool ok = s_canopen->sendNMTCommand(nmtCmd, nodeId);
        printf("NMT %s to node %u: %s\r\n", cmd, nodeId, ok ? "OK" : "FAIL");
    }

    static void cmdSDORead(char *args)
    {
        if (s_canopen == nullptr)
        {
            printf("CANopen not initialized\r\n");
            return;
        }

        char *nodeStr = strtok(args, " ");
        char *indexStr = strtok(nullptr, " ");
        char *subStr = strtok(nullptr, " ");

        if (nodeStr == nullptr || indexStr == nullptr || subStr == nullptr)
        {
            printf("Usage: sdo read <nodeId> <index> <subIndex>\r\n");
            return;
        }

        uint8_t nodeId = static_cast<uint8_t>(parseNumber(nodeStr));
        uint16_t index = static_cast<uint16_t>(parseNumber(indexStr));
        uint8_t subIndex = static_cast<uint8_t>(parseNumber(subStr));

        std::array<uint8_t, 64> buf{};
        auto result = s_canopen->sdoRead(nodeId, index, subIndex, buf);

        if (result.success)
        {
            printf("SDO read OK (%zu bytes): ", result.bytesTransferred);
            for (size_t i = 0; i < result.bytesTransferred; i++)
            {
                printf("%02X ", buf[i]);
            }
            printf("\r\n");
        }
        else
        {
            printf("SDO read FAILED (abort=0x%08lX)\r\n", static_cast<unsigned long>(result.abortCode));
        }
    }

    static void cmdSDOWrite(char *args)
    {
        if (s_canopen == nullptr)
        {
            printf("CANopen not initialized\r\n");
            return;
        }

        char *nodeStr = strtok(args, " ");
        char *indexStr = strtok(nullptr, " ");
        char *subStr = strtok(nullptr, " ");

        if (nodeStr == nullptr || indexStr == nullptr || subStr == nullptr)
        {
            printf("Usage: sdo write <nodeId> <index> <subIndex> <byte0> [byte1..]\r\n");
            return;
        }

        uint8_t nodeId = static_cast<uint8_t>(parseNumber(nodeStr));
        uint16_t index = static_cast<uint16_t>(parseNumber(indexStr));
        uint8_t subIndex = static_cast<uint8_t>(parseNumber(subStr));

        /* Parse data bytes */
        std::array<uint8_t, 64> data{};
        size_t dataLen = 0;

        char *byteStr = strtok(nullptr, " ");
        while (byteStr != nullptr && dataLen < data.size())
        {
            data[dataLen++] = static_cast<uint8_t>(parseNumber(byteStr));
            byteStr = strtok(nullptr, " ");
        }

        if (dataLen == 0)
        {
            printf("No data bytes provided\r\n");
            return;
        }

        auto result = s_canopen->sdoWrite(nodeId, index, subIndex, std::span{data.data(), dataLen});

        if (result.success)
        {
            printf("SDO write OK (%zu bytes)\r\n", result.bytesTransferred);
        }
        else
        {
            printf("SDO write FAILED (abort=0x%08lX)\r\n", static_cast<unsigned long>(result.abortCode));
        }
    }

    /* -------------------------------------------------------------------------- */
    /* Motor command handlers                                                     */
    /* -------------------------------------------------------------------------- */
    static constexpr uint8_t DRIVE_NODE_ID = 1;

    static const char *stateToString(Interfaces::HLDriver::CiA402State state)
    {
        using S = Interfaces::HLDriver::CiA402State;
        switch (state)
        {
        case S::NotReadyToSwitchOn:
            return "NotReadyToSwitchOn";
        case S::SwitchOnDisabled:
            return "SwitchOnDisabled";
        case S::ReadyToSwitchOn:
            return "ReadyToSwitchOn";
        case S::SwitchedOn:
            return "SwitchedOn";
        case S::OperationEnabled:
            return "OperationEnabled";
        case S::QuickStopActive:
            return "QuickStopActive";
        case S::FaultReactionActive:
            return "FaultReactionActive";
        case S::Fault:
            return "Fault";
        default:
            return "Unknown";
        }
    }

    static void cmdMotor(char *args)
    {
        if (s_motor == nullptr)
        {
            printf("Motor driver not available\r\n");
            return;
        }

        char *subcmd = strtok(args, " ");
        if (subcmd == nullptr)
        {
            printf("Usage: motor <init|enable|disable|stop|status|mode|move|velocity|fault-reset>\r\n");
            return;
        }

        if (strcmp(subcmd, "init") == 0)
        {
            bool ok = s_motor->init(DRIVE_NODE_ID);
            printf("Motor init: %s\r\n", ok ? "OK" : "FAIL");
        }
        else if (strcmp(subcmd, "enable") == 0)
        {
            bool ok = s_motor->enable();
            printf("Motor enable: %s\r\n", ok ? "OK" : "FAIL");
        }
        else if (strcmp(subcmd, "disable") == 0)
        {
            bool ok = s_motor->disable();
            printf("Motor disable: %s\r\n", ok ? "OK" : "FAIL");
        }
        else if (strcmp(subcmd, "stop") == 0)
        {
            bool ok = s_motor->quickStop();
            printf("Motor quick stop: %s\r\n", ok ? "OK" : "FAIL");
        }
        else if (strcmp(subcmd, "status") == 0)
        {
            auto st = s_motor->getStatus();
            printf("Drive state:    %s\r\n", stateToString(st.state));
            printf("Statusword:     0x%04X\r\n", st.rawStatusword);
            printf("Actual pos:     %ld\r\n", static_cast<long>(st.actualPosition));
            printf("Active mode:    %d\r\n", st.activeModeDisplay);
            printf("Target reached: %s\r\n", st.targetReached ? "yes" : "no");
            printf("Fault:          %s\r\n", st.fault ? "YES" : "no");
            printf("Warning:        %s\r\n", st.warning ? "YES" : "no");
        }
        else if (strcmp(subcmd, "mode") == 0)
        {
            char *modeStr = strtok(nullptr, " ");
            if (modeStr == nullptr)
            {
                printf("Usage: motor mode <pp|pv>\r\n");
                return;
            }

            using Mode = Interfaces::HLDriver::OperationMode;
            Mode mode;
            if (strcmp(modeStr, "pp") == 0)
            {
                mode = Mode::ProfilePosition;
            }
            else if (strcmp(modeStr, "pv") == 0)
            {
                mode = Mode::ProfileVelocity;
            }
            else
            {
                printf("Unknown mode: %s (use pp or pv)\r\n", modeStr);
                return;
            }

            bool ok = s_motor->setOperationMode(mode);
            printf("Set mode: %s\r\n", ok ? "OK" : "FAIL");
        }
        else if (strcmp(subcmd, "move") == 0)
        {
            char *posStr = strtok(nullptr, " ");
            char *relStr = strtok(nullptr, " ");
            if (posStr == nullptr)
            {
                printf("Usage: motor move <position> [rel]\r\n");
                return;
            }

            auto pos = static_cast<int32_t>(strtol(posStr, nullptr, 10));
            bool relative = (relStr != nullptr && strcmp(relStr, "rel") == 0);

