daleondev/STM32_CANopen/src/SerialCLI.cpp
    /* -------------------------------------------------------------------------- */
    /* Command dispatcher                                                         */
    /* -------------------------------------------------------------------------- */
    static void processCommand(char *line)
    {
        /* Skip leading whitespace */
        while (*line != '\0' && std::isspace(static_cast<unsigned char>(*line)))
        {
            line++;
        }

        if (*line == '\0')
        {
            return;
        }

        /* Extract first token */
        char *cmd = strtok(line, " ");
        char *rest = strtok(nullptr, ""); /* remainder */

        if (strcmp(cmd, "help") == 0)
        {
            cmdHelp();
        }
        else if (strcmp(cmd, "status") == 0)
        {
            cmdStatus();
        }
        else if (strcmp(cmd, "nmt") == 0)
        {
            cmdNMT(rest);
        }
        else if (strcmp(cmd, "sdo") == 0)
        {
            /* Next token: read or write */
            char *subcmd = strtok(rest, " ");
            char *subrest = strtok(nullptr, "");

            if (subcmd != nullptr && strcmp(subcmd, "read") == 0)
            {
                cmdSDORead(subrest);
            }
            else if (subcmd != nullptr && strcmp(subcmd, "write") == 0)
            {
                cmdSDOWrite(subrest);
            }
            else
            {
                printf("Usage: sdo <read|write> ...\r\n");
            }
        }
        else if (strcmp(cmd, "motor") == 0)
        {
            cmdMotor(rest);
        }
        else if (strcmp(cmd, "nt") == 0)
        {
            cmdNanotec(rest);
        }
        else
        {
            printf("Unknown command: %s (type 'help')\r\n", cmd);
        }
    }

    /* -------------------------------------------------------------------------- */
    /* Public API                                                                 */
    /* -------------------------------------------------------------------------- */
    void init(Interfaces::HLDriver::ICANopen &canopen,
              Interfaces::HLDriver::ICiA402 *motor,
              Interfaces::HLDriver::INanotecPnD *nanotec)
    {
        s_canopen = &canopen;
        s_motor = motor;
        s_nanotec = nanotec;
    }

    [[noreturn]] void run()
    {
        printf("\r\n=== CANopen Master CLI ===\r\n");
        printf("Type 'help' for available commands.\r\n");

        std::array<char, MAX_CMD_LEN> cmdBuf{};

        while (true)
        {
            printf("> ");
            fflush(stdout);

            size_t len = readLine(cmdBuf.data(), cmdBuf.size());
            if (len > 0)
            {
                processCommand(cmdBuf.data());
            }
        }
    }

} // namespace SerialCLI
